app/views/clients/show.html.erb

<%= link_to("Add New Goal", new_goal_path( :'data-client-id' => @client.id )) %>
<% @client.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."client_id" = $1  [["client_id", 1]]