app/views/coaches/show.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."coach_id" = $1  [["coach_id", 1]]
---

      <% @coach.clients.each do |client| %>