app/controllers/clients_controller.rb

  def create
    @client = Client.create(client_params)
---
INSERT INTO "clients" ("full_name", "email", "password_digest", "coach_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def find
    @client = Client.find_by(email: params[:email])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."email" = $1 LIMIT 1  [["email", "dom.fow@gmail.com"]]

  def edit
    @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 4]]

  def update
    @client = Client.find(params[:id])
    if params[:client][:password] == params[:client][:password_confirmation]
      @client.update_attributes(client_params)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "clients" SET "password_digest" = $1, "first_login" = $2, "updated_at" = $3 WHERE "clients"."id" = $4  [["password_digest", "$2a$10$nB3/C518BAZIGIYStsm5.OlF.qpySVkJ3SNQQxlbW8HOy6ZN3OCBm"], ["first_login", "f"], ["updated_at", "2015-12-03 22:17:19.904395"], ["id", 4]]

  def show
    @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 4]]