app/controllers/coaches_controller.rb

  def create
    @coach = Coach.new(coach_params)
    if @coach.save
---
INSERT INTO "coaches" ("full_name", "email", "password_digest", "company_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @coach = Coach.find(params[:id])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = $1 LIMIT 1  [["id", 3]]

  def find
    @coach = Coach.find_by(email: params[:email])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."email" = $1 LIMIT 1  [["email", "billy@gmail.com"]]