app/controllers/goals_controller.rb

  def create
    @goal = Goal.create(goal_params)
---
INSERT INTO "goals" ("statement", "notes", "client_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["statement", "Get an offer letter back."], ["notes", "No less than 90K"], ["client_id", 1], ["created_at", "2015-12-04 02:20:32.230604"], ["updated_at", "2015-12-04 02:20:32.230604"]]